Revit 2024 API
BuiltInFailures.CreationFailures.CannotCreateSlantedWallWithSingularLayersError Property
 Cannot create wall - its layers would degenerate or. Reduce the wall's height or slant.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateSlantedWallWithSingularLayersError { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateSlantedWallWithSingularLayersError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateSlantedWallWithSingularLayersError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace